r1f1/STM32_drivers/stm32f407_drivers/Src/004ButtonInterrupt.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include "stm32f407xx.h"

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#define HIGH			1
#define LOW 			0
#define BTN_PRESSED		LOW

void delay(void){
	/* Delay of ~200ms when the system clock is 16Mhz */
	for (uint32_t i = 0; i < 500000/2; i++);
}

int main(){
	GPIO_Handle_t GpioLed, GPIOBtn;
	memset(&GpioLed, 0, sizeof(GpioLed)); // Clear and set to zero all the structures parameters
	memset(&GPIOBtn, 0, sizeof(GPIOBtn));


	/* LED configuration */

	GpioLed.pGPIOx = GPIOD;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_11;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GpioLed);

	/* Button pin configuration */

	GPIOBtn.pGPIOx = GPIOD;
	GPIOBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_3;
	GPIOBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_FT;
	GPIOBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
	GPIOBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;


	GPIO_Init(&GPIOBtn);

	GPIO_WriteToOutputPin(GPIOD, GPIO_PIN_NO_11, GPIO_PIN_RESET);
	/* IRQ configuration */

	GPIO_IRQPriorityConfig(IRQ_NO_EXTI3, NVIC_IRQ_PRI15);
	GPIO_IRQInterruptConfig(IRQ_NO_EXTI3, ENABLE);

	while(1);

}
/*
 * Get this function from the startup code
 * This is the function that the processor will execute when an IRQ number is selected
 * In the vector table is the address where this function is located?
 */
void EXTI3_IRQHandler(void){
	delay();
	GPIO_IRQHandling(GPIO_PIN_NO_3);
	GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_11);
}
